homeworks/HW05/jmeter/plans/23127543_Stress_20260811.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="HW05 Stress Test" enabled="true">
      <stringProp name="TestPlan.comments">Same workflow as load test; heavier concurrency for stress observation.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="BASE_URL" elementType="Argument"><stringProp name="Argument.name">BASE_URL</stringProp><stringProp name="Argument.value">http://localhost:3000</stringProp></elementProp></collectionProp></elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stress Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">2</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">30</stringProp>
        <stringProp name="ThreadGroup.ramp_time">90</stringProp>
        <longProp name="ThreadGroup.start_time">0</longProp><longProp name="ThreadGroup.end_time">0</longProp><boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Customer Data" enabled="true"><stringProp name="filename">data/users.csv</stringProp><stringProp name="variableNames">email,password</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="ignoreFirstLine">true</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp></CSVDataSet><hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Admin Data" enabled="true"><stringProp name="filename">data/admin-users.csv</stringProp><stringProp name="variableNames">admin_email,admin_password</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="ignoreFirstLine">true</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp></CSVDataSet><hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Product Data" enabled="true"><stringProp name="filename">data/products.csv</stringProp><stringProp name="variableNames">product_id,product_name,product_price</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="ignoreFirstLine">true</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp></CSVDataSet><hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Checkout Data" enabled="true"><stringProp name="filename">data/checkout-data.csv</stringProp><stringProp name="variableNames">shipping_address</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="ignoreFirstLine">true</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp></CSVDataSet><hashTree/>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.domain">localhost</stringProp><stringProp name="HTTPSampler.port">3000</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp></ConfigTestElement><hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Common Headers" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="Cookie Manager" enabled="true"><boolProp name="CookieManager.clearEachIteration">true</boolProp></CookieManager><hashTree/>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true"><stringProp name="ConstantTimer.delay">1000</stringProp></ConstantTimer><hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Customer Login" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{"email":"${email}","password":"${password}"}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/login</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy>
        <hashTree><RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Customer Token" enabled="true"><stringProp name="RegexExtractor.refname">customerToken</stringProp><stringProp name="RegexExtractor.regex">"token"\s*:\s*"([^"]+)"</stringProp><stringProp name="RegexExtractor.template">$1$</stringProp><stringProp name="RegexExtractor.default">NOT_FOUND</stringProp><stringProp name="RegexExtractor.match_number">1</stringProp></RegexExtractor><hashTree/></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Browse Products" enabled="true"><stringProp name="HTTPSampler.path">/api/products</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.postBodyRaw">false</boolProp></HTTPSamplerProxy><hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product Details" enabled="true"><stringProp name="HTTPSampler.path">/api/products/${product_id}</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.postBodyRaw">false</boolProp></HTTPSamplerProxy><hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Add to Cart" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{"id":${product_id},"name":"${product_name}","price":${product_price},"quantity":1}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/cart</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy>
        <hashTree><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Customer Auth Headers" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${customerToken}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Checkout" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{"total_amount":${product_price},"shipping_address":"${shipping_address}"}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/checkout</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy>
        <hashTree><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Checkout Headers" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${customerToken}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/></hashTree>
        <ResultCollector guiclass="AggregateReportGui" testclass="ResultCollector" testname="Aggregate Report" enabled="true"><boolProp name="ResultCollector.error_logging">false</boolProp></ResultCollector><hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>